In [2]:
import pandas as pd
from matplotlib import pyplot as ply
import seaborn as sb
import warnings
warnings.filterwarnings('ignore')

In [4]:
df_melt = pd.DataFrame({'Name':{0: 'Nik', 1: 'Kal', 2: 'Balaji'},
                      'Course':{0: 'PHD', 1: 'PHD', 2: 'Masters'},
                      'Age':{0: 27, 1: 23, 2: 21}})

In [5]:
df_melt

     Name   Course  Age
0     Nik      PHD   27
1     Kal      PHD   23
2  Balaji  Masters   21

In [6]:
pd.melt(df_melt, id_vars=['Name'], value_vars=['Course'])

     Name variable    value
0     Nik   Course      PHD
1     Kal   Course      PHD
2  Balaji   Course  Masters

In [7]:
pd.melt(df_melt, id_vars=['Name'], value_vars=['Course','Age'])

     Name variable    value
0     Nik   Course      PHD
1     Kal   Course      PHD
2  Balaji   Course  Masters
3     Nik      Age       27
4     Kal      Age       23
5  Balaji      Age       21

In [8]:
pd.melt(df_melt, id_vars=['Name'], value_vars=['Course'],
       var_name='NameChanged', value_name='CourseChanged')

     Name NameChanged CourseChanged
0     Nik      Course           PHD
1     Kal      Course           PHD
2  Balaji      Course       Masters